<?php

//error_reporting(-1);

// Постфиксный и префиксный инкремент. $a++, ++$a
// Постфиксный и префиксный декримент. $a--, --$a

/*
$a = 5;
var_dump($a++); // Сначала var_dump возвращает оригинальное значение, а потом прибавляет единицу.
var_dump($a);

var_dump(++$a); // Сначала склыдывается, а потом выводится итоговое значение.
var_dump($a--); // Тоже самое с вычитанием.
var_dump(--$a);

$a = $a + 1; // Аналогичная запись. $a++/ 
*/

// Конкатенация.

/*
$str1 = 'Hello,';
$str2 = ' world!';

$str = $str1 . $str2;
echo $str;
*/

/*
$fruit = 'apple';
echo $winnie_pooh = 'Hello I"m Winnie. I have 2' .  $fruit . 's';
*/

// Комбинированные операторы.

/*
$a = 5;
$a = $a + 2; // Исходное выражение.
$a += 2; // Сложение
$a -= 2; // Вычитание
$a *= 2; // Умножение
$a /= 2; // Деление
var_dump($a);
*/


/*
$str1 = 'Hello,';
echo $str1 .= ' world!';
*/

//NULL

//var_dump($var); // null
/*
$var = '';
unset($var);
var_dump($var);
*/

/*
$var = NULL;
$var++; // Декремент в этом случае не работает. Если переменной не было инкремент все равно прибавит.
var_dump($var);
*/














